{"keras_version": "1.2.0", "config": [{"config": {"output_shape": null, "name": "lambda_1", "batch_input_shape": [null, 18, 80, 1], "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\fnew_model.py\u00da\b<lambda>:\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "arguments": {}, "trainable": true, "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"border_mode": "valid", "activity_regularizer": null, "name": "convolution2d_1", "subsample": [1, 1], "bias": true, "activation": "linear", "b_constraint": null, "W_regularizer": null, "nb_filter": 16, "init": "glorot_uniform", "W_constraint": null, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "trainable": true, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "activity_regularizer": null, "name": "convolution2d_2", "subsample": [1, 1], "bias": true, "activation": "linear", "b_constraint": null, "W_regularizer": null, "nb_filter": 8, "init": "glorot_uniform", "W_constraint": null, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "trainable": true, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "activity_regularizer": null, "name": "convolution2d_3", "subsample": [1, 1], "bias": true, "activation": "linear", "b_constraint": null, "W_regularizer": null, "nb_filter": 4, "init": "glorot_uniform", "W_constraint": null, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "trainable": true, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "activity_regularizer": null, "name": "convolution2d_4", "subsample": [1, 1], "bias": true, "activation": "linear", "b_constraint": null, "W_regularizer": null, "nb_filter": 2, "init": "glorot_uniform", "W_constraint": null, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "trainable": true, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.25, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 16, "activity_regularizer": null, "name": "dense_1", "bias": true, "activation": "linear", "b_constraint": null, "W_regularizer": null, "input_dim": 360, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"output_dim": 16, "activity_regularizer": null, "name": "dense_2", "bias": true, "activation": "linear", "b_constraint": null, "W_regularizer": null, "input_dim": 16, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_6", "trainable": true}, "class_name": "Activation"}, {"config": {"output_dim": 16, "activity_regularizer": null, "name": "dense_3", "bias": true, "activation": "linear", "b_constraint": null, "W_regularizer": null, "input_dim": 16, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_7", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"output_dim": 1, "activity_regularizer": null, "name": "dense_4", "bias": true, "activation": "linear", "b_constraint": null, "W_regularizer": null, "input_dim": 16, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}